<template>
  <main>
    <n-layout>
      <n-layout-content>
        <n-grid cols="7" item-responsive responsive="screen" x-gap="12" y-gap="12">
          <n-gi span="7 m:5 l:5" offset="0 m:1 l:1">
            <n-card>
              <h1>О сервисе</h1>

              <p>
                Сервис предоставляет возможность смотреть фильмы и сериалы используя плееры, которые
                предоставляются сторонними сервисами, являясь аггрегатором таких плееров и парсером
                данных с Кинопоиска.
                <br />
                Сервис не хранит видеофайлы на своих серверах.
                <br />
                Сервис не хранит информацию о пользователях.
                <br />
                Сервис не хранит информацию о просмотренных фильмах.
                <br />
                Сервис может кэшировать некоторые запросы, чтобы уменьшить нагрузку на сторонние
                сервисы.
              </p>

              <p></p>
              <h2>Отказ от ответственности</h2>
              Сервис не несет ответственности за содержание, качество и авторские права на контент,
              который он предоставляет.
              <br />
              <b>Все материалы взяты из открытых источников.</b>
            </n-card>
          </n-gi>
        </n-grid>
      </n-layout-content>
    </n-layout>
  </main>
</template>

<script setup lang="ts">
import { NLayout, NLayoutContent, NCard, NGrid, NGi, NDivider } from 'naive-ui'
</script>
